src/xml/request/7.rank.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:open="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <open:searchRequest>
      <open:query>angora</open:query>
      <open:agency>100200</open:agency>
      <open:profile>test</open:profile>
      <open:start>1</open:start>
      <open:stepValue>10</open:stepValue>
      <open:sort>rank_general</open:sort>
      <open:queryDebug>1</open:queryDebug>    
    </open:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
